RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x_misc.h
/***************COPYRIGHT(C)  2019 WCH. A11 rights reserved*********************
* File Name          : ch32f10x_misc.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2019/10/15
* Description        : CThis file contains all the functions prototypes for the 
*                      miscellaneous firmware library functions (add-on to CMSIS functions).
*******************************************************************************/   
#ifndef __CH32F10X_MISC_H
#define __CH32F10X_MISC_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "ch32f10x.h"

/* NVIC Init Structure definition */	 
typedef struct
{
  uint8_t NVIC_IRQChannel;                    /*!< Specifies the IRQ channel to be enabled or disabled.
                                                   This parameter can be a value of @ref IRQn_Type 
                                                   (For the complete ch32 Devices IRQ Channels list, please
                                                    refer to ch32f10x.h file) */

  uint8_t NVIC_IRQChannelPreemptionPriority;  /*!< Specifies the pre-emption priority for the IRQ channel
                                                   specified in NVIC_IRQChannel. This parameter can be a value
                                                   between 0 and 15 as described in the table @ref NVIC_Priority_Table */

  uint8_t NVIC_IRQChannelSubPriority;         /*!< Specifies the subpriority level for the IRQ channel specified
                                                   in NVIC_IRQChannel. This parameter can be a value
                                                   between 0 and 15 as described in the table @ref NVIC_Priority_Table */

  FunctionalState NVIC_IRQChannelCmd;         /*!< Specifies whether the IRQ channel defined in NVIC_IRQChannel
                                                   will be enabled or disabled. 
                                                   This parameter can be set either to ENABLE or DISABLE */   
} NVIC_InitTypeDef;
 

/*
 * NVIC_Priority_Table:
 * The table below gives the allowed values of the pre-emption priority and subpriority according
 * to the Priority Grouping configuration performed by NVIC_PriorityGroupConfig function
 * ============================================================================================================================
 *   NVIC_PriorityGroup   | NVIC_IRQChannelPreemptionPriority | NVIC_IRQChannelSubPriority  | Description
 * ============================================================================================================================
 *  NVIC_PriorityGroup_0  |                0                  |            0-15             |   0 bits for pre-emption priority
 *                        |                                   |                             |   4 bits for subpriority
 * ----------------------------------------------------------------------------------------------------------------------------
 *  NVIC_PriorityGroup_1  |                0-1                |            0-7              |   1 bits for pre-emption priority
 *                        |                                   |                             |   3 bits for subpriority
 * ----------------------------------------------------------------------------------------------------------------------------    
 *  NVIC_PriorityGroup_2  |                0-3                |            0-3              |   2 bits for pre-emption priority
 *                        |                                   |                             |   2 bits for subpriority
 * ----------------------------------------------------------------------------------------------------------------------------    
 *  NVIC_PriorityGroup_3  |                0-7                |            0-1              |   3 bits for pre-emption priority
 *                        |                                   |                             |   1 bits for subpriority
 * ----------------------------------------------------------------------------------------------------------------------------    
 *  NVIC_PriorityGroup_4  |                0-15               |            0                |   4 bits for pre-emption priority
 *                        |                                   |                             |   0 bits for subpriority                       
 * ============================================================================================================================
 * 
 */


/* Vector_Table_Base */
#define NVIC_VectTab_RAM               ((uint32_t)0x20000000)
#define NVIC_VectTab_FLASH             ((uint32_t)0x08000000)

/* System_Low_Power */
#define NVIC_LP_SEVONPEND              ((uint8_t)0x10)
#define NVIC_LP_SLEEPDEEP              ((uint8_t)0x04)
#define NVIC_LP_SLEEPONEXIT            ((uint8_t)0x02)


/* Preemption_Priority_Group */
#define NVIC_PriorityGroup_0           ((uint32_t)0x700) /*!< 0 bits for pre-emption priority
                                                            4 bits for subpriority */
#define NVIC_PriorityGroup_1           ((uint32_t)0x600) /*!< 1 bits for pre-emption priority
                                                            3 bits for subpriority */
#define NVIC_PriorityGroup_2           ((uint32_t)0x500) /*!< 2 bits for pre-emption priority
                                                            2 bits for subpriority */
#define NVIC_PriorityGroup_3           ((uint32_t)0x400) /*!< 3 bits for pre-emption priority
                                                            1 bits for subpriority */
#define NVIC_PriorityGroup_4           ((uint32_t)0x300) /*!< 4 bits for pre-emption priority
                                                            0 bits for subpriority */

/* SysTick_clock_source */
#define SysTick_CLKSource_HCLK_Div8    ((uint32_t)0xFFFFFFFB)
#define SysTick_CLKSource_HCLK         ((uint32_t)0x00000004)

/* MISC_Exported_Functions */
void NVIC_PriorityGroupConfig(uint32_t NVIC_PriorityGroup);
void NVIC_Init(NVIC_InitTypeDef* NVIC_InitStruct);
void NVIC_SetVectorTable(uint32_t NVIC_VectTab, uint32_t Offset);
void NVIC_SystemLPConfig(uint8_t LowPowerMode, FunctionalState NewState);
void SysTick_CLKSourceConfig(uint32_t SysTick_CLKSource);

#ifdef __cplusplus
}
#endif

#endif /* __CH32F10x_MISC_H */

